tutorials/14pisoUnsteadyNS/system/ITHACAdict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      ITHACAdict;
}

// EigenValue solver, can be eigen or spectra
EigenSolver eigen;

// Number of modes to output and to use for projection
NmodesUout 20;
NmodesUproj 15;
NmodePUout 20;
NmodesPproj 15;
NmodesSUPout 20;
NmodesSUPproj 15;

// Output format to save market vectors.
OutPrecision 20;
OutType fixed;

// Specific problem of a stationary case
tolerance 1e-6;

// Reduced simple cicle parameters
residualJumpLim 1e-6;
normalizedResidualLim 1e-6;

// Inlet boundary conditions velocities.
online_velocities vel.txt;


